




// #XjJuucOMR0
// - Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)
//


{
    function User(id, name, surname, email, phone) {
        this.id = id;
        this.name = name;
        this.surname = surname;
        this.email = email;
        this.phone = phone;
    }

    let users = [
        new User(11, 'hffh', 'kkk', 'uiui', '+3646525'),
        new User(1, 'hffh', 'kkk', 'uiui', '+3646525'),
        new User(14, 'hffh', 'kkk', 'uiui', '+3646525'),
        new User(12, 'hffh', 'kkk', 'uiui', '+3646525'),
    ];

    // console.log(users);


// #2ikXsE2WiKZ
// - Взяти масив з  User[] з попереднього завдання, та відфільтрувати ,
// залишивши тільки об'єкти з парними id (filter)
//
    let sort1 = users.filter((value, index) => {
        return value.id % 2 === 0;

    })
    console.log(sort1);


// #pOeHKct
// - Взяти масив з  User[] з попереднього завдання, та відсортувати його по id. по зростанню (sort)
//


    let sort2 = users.sort((a1, a2) => {
        return a1.id - a2.id;

    })
    console.log(sort2);
}

// #nkMXISv
// - створити конструктор для об'єктів Client з полями id, name, surname , email, phone, order (поле є масивом
// зі списком товарів)
// створити пустий масив, наповнити його 10 об'єктами Client

{

    function Client(id, name, surname, email, phone, order) {
        this.id = id;
        this.name = name;
        this.surname = surname;
        this.email = email;
        this.phone = phone;
        this.order = order;
    }

    let clients = [
        new Client(1, "вуа", "рлртир", "tth", "+380991234567", ["Замовлення 1", "Замовлення 2", "Замовлення 3","Замовлення 4"]),
        new Client(2, "ее", "рлил", "hhh", "+380991234567", ["Замовлення 1", "Замовлення 2"]),
        new Client(3, "щщ", "Пбд ьтб", "ddd", "+380991234567", ["Замовлення 1", "Замовлення 2", "Замовлення 3"]),

    ]
    console.log(clients);



// #8abtVjRv
// - Взяти масив (Client [] з попереднього завдання).Відсортувати його по кількості
// товарів в полі order по зростанню. (sort)

    let sort3 = clients.sort((a1, a2) => a1.order.length - a2.order.length);
    console.log(sort3);

}






// #vV9a6584I5
// - Створити функцію конструктор яка дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car
//
//












// #5kla3yMpgp
// - (Те саме, тільки через клас)
// Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// -- drive () - яка виводить в консоль `їдемо зі швидкістю ${максимальна швидкість} на годину`
// -- info () - яка виводить всю інформацію про автомобіль в форматі `назва поля - значення поля`
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і додає його в поточний об'єкт car
//
//
//

















// #zg6Fifnqig
// -створити класс/функцію конструктор попелюшка з полями ім'я, вік, розмір ноги. Створити масив з 10 попелюшок.
// Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
//     За допомоги циклу знайти яка попелюшка повинна бути з принцом.
//     Додатково, знайти необхідну попелюшку за допомоги функції масиву find та відповідного колбеку
//
//
//









// #gsKLAsNWM
// *Через Array.prototype. створити власний foreach, filter