





// -------------------------------------- математика------------------------
// Math.round(s);   // заокруглення до цілого
//
// s.toFixed(3); //заокреглення до 3 чисел після коми


// ***************************************************************************************************



// -------------------------------------- МАСИВИ------------------------
//
//
// a.forEach(i);  //перебір елементів масиву
//

// newArrayS.join("\n"); // кожен елемент масиву з нового рядка
//
//

//
// {
//     // псевдо-масив, тобто ОБ'ЄКТ. (ВИВОДИТЬ ВСІ ЗМІННІ ЯКІ ЗАПИШЕШ,
//     // НАВІТЬ ЯКШО ЇХ МЕНШЕ АБО БІЛЬШЕ ЗА ВКАЗАННІ ЗМІННІ)
//
//     function foo(a,b) {
//         console.log(arguments);
//
//     }
//     foo(20, 50, 15 );
//
// }


//
// (...arr) "розгортає" масив у список окремих значень.
//     Тобто, ...arr перетворює масив [-10, 1, 1, 2, 10, -5, 6, 0] у: -10, 1, 1, 2, 10, -5, 6, 0
//     Після цього Math.min(...arr) стає еквівалентним Math.min(-10, 1, 1, 2, 10, -5, 6, 0).

// Math.min(...arr) //мінімальне


// Замість циклу for...of використано метод find, який знаходить перший елемент масиву a.find(i)